# FabricWireItem Methods

---
The FabricWireItem type exposes the following members.
| Name| Description
---|---|---
| Create|  Creates a new instance of a single Fabric wire.
| Dispose|
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace